{
  "chapter": "24",
  "title": "ROADS, STREETS AND OTHER PUBLIC PROPERTY",
  "articles": [
    {
      "id": "I",
      "title": "ENCROACHMENTS",
      "sections": [
        {
          "id": "24-10",
          "title": "Definitions",
          "text": "For the purposes of this article, the following words and phrases shall have the meanings respectively ascribed to them by this section: **County road** means all or any part of the entire width of any road or street, including the width of any right-of-way dedicated to, reserved for, used by or for the general public, when those roads or streets have been accepted as and declared to be a part of the county road system. **Director** means the director of the transportation department of the county or the director’s designees. **Encroachment** means any tower, pole, pole line, pipe, pipeline, driveway, private road, curb and gutter, sidewalk, fence, wall, billboard, stand, building, structure, tree, shrub or object of any kind or character not particularly mentioned herein which is placed in, under or over any portion of the county road, or as further defined by provisions of Streets and Highways Code §§ 1450 and 1480(b). Encroachment shall also mean a driveway from a county public road to an abutting property. The location, construction, maintenance and use of the driveway require an encroachment permit to provide for public safety. **Permittee** means any person as herein defined that has been issued a permit for an encroachment. The permit may be for the actual work performed or for the encroachment itself or for both the work and the encroachment. The permit for the work alone is normally issued to a contractor. The owner of the encroachment must in all events obtain a permit for the encroachment itself, and alternatively, the owner may obtain a permit both for the work and the encroachment itself. The director may specify the procedure to be used. **Person** means any individual, firm, company, corporation, association, public district, political subdivision or organization.",
          "ordinances": [
            "913",
            "1462"
          ]
        },
        {
          "id": "24-11",
          "title": "Acts requiring permits",
          "text": "(a) It shall be unlawful for any person to construct, maintain, make, place or install any encroachment along or on any county road without first obtaining a permit to do so in the manner herein provided. (b) This article shall not prevent any person from performing emergency maintenance on any pipe, conduit, pole, line or appurtenance thereto lawfully on or under any county road, or from making immediate installation of utility service, or from making an emergency use, or encroachment as may be necessary for the preservation of life or property when an urgent necessity arises; except, that the person making an emergency use or encroachment of a county road shall apply for a written permit within a reasonable time thereafter.",
          "ordinances": [
            "913",
            "1251",
            "1462"
          ]
        },
        {
          "id": "24-12",
          "title": "Permits",
          "text": "(a) Any person desiring to construct, make, place or install an encroachment shall make application to the director for a permit. Each application shall be made on a form furnished by the director and shall include the following information: (1) The name and address of the person desiring to make the encroachment. (2) The type of encroachment proposed and the purpose thereof. (3) The location of the proposed encroachment. (4) The time when the encroachment is proposed to be made and the duration thereof. (5) Such other information in the form of exhibits, including, but not limited to, plans, specifications, maps, plats or sketches as may be required by the director to adequately describe the encroachment and the manner in which it is proposed to be done. (b) The director shall receive applications to construct, make, place or install encroachments, and may issue written permits, subject to the terms and conditions provided herein, and such additional terms and conditions as he may deem necessary. (c) Any permit issued under the provisions of this article shall require that the permittee will pay the entire expense of replacing the county road in as good condition as existed prior to the start of work on the encroachment. (d) A fee may be charged for any permit issued under the provisions of this article. The amount of the fee shall be as established in a fee schedule adopted by ordinance by the board of supervisors. The applicant shall deposit the required fee with the director prior to the issuance of the permit. (e) Any permit issued to a public agency or a public utility having lawful authority to occupy the county road shall contain a provision that in the event the future improvement of the county road necessitates the relocation of such encroachment, the permittee or the permittee’s successor shall relocate the same at the permittee’s sole expense. (f) All permits, other than those issued to public agencies or a public utility having lawful authority to occupy the county road, are revocable on five days notice, and the encroachment must be removed or relocated as may be specified by the director. (g) Any permit issued to public agencies or utilities having the lawful authority to occupy the county road shall require that such of their facilities as interfere with an enlarged use of the county road shall be relocated upon thirty days notice by the director. (h) All permits issued hereunder shall be transferable only to successors in interest, and the work authorized by the permit must be completed within six months of the date of issuance thereof. The director of the department of transportation may grant a reasonable time extension when warranted. In the event the work authorized by the permit is not completed within six months of the date of issuance of the permit, or within the time extension if any granted by the director, the permit shall be void and the permittee shall restore the road to its original condition prior to start of work on the encroachment. (i) The issuance of a permit hereunder shall not be construed as imposing any liability upon the county or upon any of its officers or employees by reason of damage or injury to persons or property resulting from any excavation or obstruction authorized by such permit. (j) No changes may be made in the location, dimensions, character or duration of the encroachment, except on written authority of the director.",
          "ordinances": [
            "913",
            "1251",
            "1462"
          ]
        },
        {
          "id": "24-13",
          "title": "Bonds or deposits",
          "text": "(a) If required by the director of the transportation department, the applicant shall deposit with the director a cash deposit, certified check or approved surety bond in an amount determined by the director to be sufficient to restore the road to its original condition prior to start of work on the encroachment in the event that the permittee fails to complete the work in accordance with the provisions of the permit and to the satisfaction of the director. (b) The condition of any bond or deposit made pursuant to this part shall be that the permittee will diligently, and in good faith, comply with all the terms of this article and conditions of the permit. (c) Within ninety days after satisfactory completion of all work authorized in the permit, the bond or deposit will be released. (d) No deposit or bond, except as hereinafter provided in this subdivision, shall be required of any public district or political subdivision which is authorized by law to establish or maintain works or facilities in, under or over the county road, nor shall the application of any such governmental unit be denied. Every such applicant shall be entitled as a matter of right to a permit, but shall otherwise be subject to the provisions of this article. The director shall have the right to require a bond from such applicant where the applicant has failed to comply with the provisions of this article under any previous permit.",
          "ordinances": [
            "913",
            "1251",
            "1462"
          ]
        },
        {
          "id": "24-14",
          "title": "Regulations",
          "text": "(a) The permittee shall perform the work to be done in accordance with the standard plans and specifications of the department of transportation of the county, and in accordance with the requirements of the permit, unless an alternative design is required or agreed upon by the director. (b) The permittee, in the conduct of the work, use or maintenance of an encroachment authorized by a permit issued pursuant to this article, shall provide, erect or maintain such lights, barriers, warning signs, patrols, watchmen, flagmen and other safeguards as are necessary for public safety. Any omission on the part of the director to specify in the permit what lights, barriers or other protective measures or devices, or the fact that the director may not specify sufficient lights, barriers or other protective measures or devices, shall not excuse the permittee from complying with all requirements of law, and appropriate regulations and ordinances for adequately protecting the safety of those using the county road. If at any time the director finds that suitable safeguards are not being provided after having informed permittee, as well as having specified what corrective measures shall be taken, the county may provide, erect, maintain or relocate such safeguards as are deemed necessary, or may cancel the permit and restore the right-of-way to its former condition, all at the expense of the permittee. (c) The permittee shall notify the transportation director at the time of beginning work, and at the time of completion of work authorized by the permit. (d) All work or use shall be planned and executed in a manner that will cause the least interference with the safe and convenient travel of the general public at the place where the work or use is authorized, and at no time shall a county road be closed or the use thereof denied the general public without the written permission of the director. (e) Upon completion of the work, act or things for which the encroachment permit was issued, the permittee shall restore the county road as nearly as possible to its original condition. Maintenance and repair or replacement of the encroachment shall be the responsibility of the permittee. (f) Construction materials or material removed from excavation shall not be placed or stockpiled upon the traveled way or shoulder of the county road unless specifically allowed in writing on the permit. (g) The permittee shall properly provide for the passage of storm drainage water through the area of work.",
          "ordinances": [
            "913",
            "1462"
          ]
        }
      ]
    },
    {
      "id": "II",
      "title": "TERMINAL ACCESS ROUTES",
      "sections": [
        {
          "id": "24-20",
          "title": "Definitions",
          "text": "Director means the transportation director of the county of Solano. **FHWA designated route** means the National System of Interstate and Defense Highways and those portions of federal-aid-primary highways that have been qualified by the United States Secretary of Transportation pursuant to Section 35401.5(a) of the California Vehicle Code. In Solano County these routes are: I-80, I-505, I-680, and I-780. **Interstate truck** means a truck, tractor and trailer, or doubles with unlimited length pursuant to Vehicle Code Section 35401.5(a)(1) and (2). **Terminal** means a facility at which freight is consolidated to be shipped and where full load consignments may be off-loaded or at which vehicle combinations are regularly maintained, stored or manufactured pursuant to California Vehicle Code Section 35401.5(b). **Terminal access route** means a route between a FHWA designated route and terminal approved by the agencies having jurisdiction over the terminal access route. In Solano County these routes are: State Routes 12, 29, 37 and portions of 113.",
          "ordinances": [
            "1251",
            "1462"
          ]
        },
        {
          "id": "24-21",
          "title": "Application, fees and identification of terminal access routes",
          "text": "(a) Applications for terminal access routes shall be submitted to the director on a form provided by the director. (b) Application fees or other costs shall be determined by separate ordinance and shall be paid upon submittal of applications or at such other time as is determined by the director of transportation with respect to signs necessary for terminal access routes. (c) A proposed route shall be identified as a terminal access route when an application and a fee have been received and the director finds that the following additional conditions are met: (1) The application is accurate and complete; (2) The proposed route is a connection between a FHWA designated route and a terminal; (3) The proposed route is adequate to accommodate interstate trucks; (4) Other agencies traversed by the proposed route have identified and signed the route through their jurisdiction as a terminal access route; (5) The proposed route has been approved by the California Department of Transportation. (6) The proposed route has been posted with signs identifying the route as a terminal access route.",
          "ordinances": [
            "1251",
            "1462"
          ]
        },
        {
          "id": "24-22",
          "title": "Revocation of route",
          "text": "The director is authorized to revoke any approved route if such route proves to be a safety hazard for any vehicular and/or pedestrian traffic. A safety hazard is defined as inability of the interstate truck to safely negotiate the route and/or such trucks causing unsafe driving conditions for other vehicular traffic and/or pedestrians.",
          "ordinances": [
            "1251",
            "1462"
          ]
        }
      ]
    },
    {
      "id": "III",
      "title": "WORKING OF PRISONERS ON PUBLIC WORKS",
      "sections": [
        {
          "id": "24-30",
          "title": "Working of prisoners on public works",
          "text": "(a) For the purpose of this section, the following words and phrases shall have the meanings respectively ascribed to them by this section. (1) **Labor** means any physical or mental activity or work directed toward the production of services or goods. (2) **Prisoner** means any person confined in the county jail, industrial farm, road camp or similar restrictive county facility under a final judgment of imprisonment rendered in a criminal action or proceeding or as a condition of probation after suspension of execution of a sentence. (3) **Public works or ways** means any project or improvement constructed or maintained by the county, including, but not limited to, parks, buildings, paths, roads, streets, expressways, reservoirs, canals and sewers. (b) **Prisoners compelled to labor**. Any or all prisoners may be compelled to labor upon the public works or ways of the county, subject to the conditions provided in this section. (c) **Direction of labor**. The board of supervisors, through the sheriff, shall direct the projects, locations and times for performance of the labor provided for by this section. (d) **Good physical condition**. No prisoner who is physically unable to labor or who is in a state of health where labor would pose a damage to the prisoner’s well-being may be compelled to labor. Any question of the exemption from labor of a prisoner shall be determined by the sheriff after consultation with available medical personnel. (e) **Prisoners under guard**. The labor provided for by this section shall be performed under security and guard regulations as shall be enacted by the sheriff. The regulations shall include provision for the keeping of time books which will show daily the names of the prisoners required to work under this section and the exact hours of their labor.",
          "ordinances": [
            "763",
            "1462"
          ]
        }
      ]
    },
    {
      "id": "IV",
      "title": "TRAVEL REDUCTION REQUIREMENTS",
      "sections": [
        {
          "id": "24-50",
          "title": "Repealed",
          "text": "",
          "ordinances": [
            "1458",
            "1490",
            "1578"
          ]
        },
        {
          "id": "24-51",
          "title": "Repealed",
          "text": "",
          "ordinances": [
            "1458",
            "1490",
            "1578"
          ]
        },
        {
          "id": "24-52",
          "title": "Repealed",
          "text": "",
          "ordinances": [
            "1458",
            "1490",
            "1578"
          ]
        },
        {
          "id": "24-53",
          "title": "Repealed",
          "text": "",
          "ordinances": [
            "1458",
            "1490",
            "1578"
          ]
        },
        {
          "id": "24-54",
          "title": "Repealed",
          "text": "",
          "ordinances": [
            "1458",
            "1490",
            "1578"
          ]
        },
        {
          "id": "24-55",
          "title": "Repealed",
          "text": "",
          "ordinances": [
            "1458",
            "1490",
            "1578"
          ]
        },
        {
          "id": "24-56",
          "title": "Repealed",
          "text": "As to prohibition against allowing water to drain onto public street, see § 9-2 of this Code. As to motor vehicles and traffic generally, see Ch. 17.",
          "ordinances": [
            "1304"
          ]
        }
      ]
    }
  ]
}