{
  "chapter": "30",
  "title": "ADDRESS NUMBERING SYSTEM",
  "articles": [
    {
      "id": "I",
      "title": "GENERAL PROVISIONS AND SYSTEM DESCRIPTIONS",
      "sections": [
        {
          "id": "30-10",
          "title": "Purpose",
          "text": "This chapter is adopted to provide a county-wide comprehensive address numbering system to enable emergency vehicles from fire, sheriff and ambulance service to respond quickly to calls and to facilitate postal and other delivery service. A positive identification system that eliminates error and confusion and aids prompt response is deemed to be in the public interest and necessary to protect the public health, general welfare and safety of the citizens of Solano County and is authorized pursuant to Sections 65450 and 65451(b) of the Government Code.",
          "ordinances": []
        },
        {
          "id": "30-11",
          "title": "System description",
          "text": "The Solano County master address numbering system shall consist of index lines corresponding to the California Plan Grid (C.P.G.) within Solano County. The C.P.G. point identified as 147,000N 1,939,000E is established as the point of origin of the Solano County master address numbering system and assigned the grid reference number 1000. Fifty numbers shall be located sequentially for each 1,000-foot C.P.G. increment to the north and to the east from the point of origin.",
          "ordinances": [
            "1064",
            "1508"
          ]
        },
        {
          "id": "30-12",
          "title": "System maps",
          "text": "The Solano County master address numbering system shall be delineated on a series of maps at a scale of 1\" = 1000'. The maps shall show the one-thousand-foot grid index system and the address numbers assigned residences, buildings, or parcels of land. Maps at a scale other than 1\" = 1000' may be substituted in areas requiring greater precision or graphic clarity. Copies of the maps shall be kept at the office of the Solano County department of environmental management.",
          "ordinances": [
            "1064"
          ]
        },
        {
          "id": "30-13",
          "title": "Administration",
          "text": "The system shall be implemented within the unincorporated areas of Solano County by the director of environmental management for address numbering and the initial naming of new roads, and by the director of transportation for the installation of road name signs and for the renaming of existing roads. Technical assistance and information shall be mutually exchanged among all county departments as may be required in carrying out the provisions of this chapter. Funds collected from fees for road sign installation pursuant to this chapter, shall be maintained in the road fund by the department of transportation.",
          "ordinances": [
            "1064",
            "1069",
            "1182",
            "1508"
          ]
        }
      ]
    },
    {
      "id": "II",
      "title": "NUMBERING SYSTEM",
      "sections": [
        {
          "id": "30-20",
          "title": "Assignment of numbers",
          "text": "(a) The director of environmental management shall determine and assign all address numbers to single-family dwellings, duplex residences, properties and business establishments and issue the same to property owners and occupants in accordance with the provisions of this chapter. A record of all numbers assigned pursuant to this chapter shall be maintained by the director of environmental management and open for inspection by the public during business hours. (b) Multiple units within a residential or commercial building shall be identified with an alphabetical or numerical suffix and shall be classified: apartment, suite, unit or other classification as determined to be appropriate by the director of environmental management. (c) An address number for a particular location shall be assigned to the principal access based on the incremental distance between index grid lines as determined by the director of environmental management. (d) Odd numbers shall be assigned to the westerly and northerly sides of all roads and even numbers assigned to the easterly and southerly sides of all roads. (e) The predominant direction of curving and diagonal roads and applicable index increments shall be determined by the director of environmental management. (f) Address numbering exceptions may be granted where general and existing numbering integrity is otherwise preserved and numbering confusion is not likely to result.",
          "ordinances": [
            "1064",
            "1182",
            "1508"
          ]
        },
        {
          "id": "30-21",
          "title": "Display of numbers",
          "text": "(a) Upon receipt of the address number from the director of environmental management, the occupant or owner of the property or building shall cause the number to be displayed upon the building or land in such a manner as to be visible from the road upon which the land or building fronts, and shall remove or obscure from public view any old or obsolete number not in accordance with the system. (b) In areas where buildings and/or properties front upon roads where mail delivery is provided, the number shall be displayed upon mailboxes or receptacles designed for receipt of mail. (c) Where residences and/or properties front upon roads not receiving mail delivery, the number and road name upon which the building and/or property fronts shall be displayed to the satisfaction of the director of environmental management. (d) Where residences and/or property are not clearly visible from the road, access identification other than mailboxes shall be on 4\" x 4\" wood posts, metal stakes or equivalent markers elevated at least three feet for clear visibility and rapid directional identification to the satisfaction of the director of environmental management. (e) Residence and/or building address number shall be conspicuous to insure positive identification and placed at front doors, on lamp posts, near garage doors, at driveway entrances or other areas of similar proximity and visibility to the satisfaction of the director of environmental management. (f) All address numbers shall be a minimum height of three inches, reflective and/or a color contrasting with the surface where placed.",
          "ordinances": [
            "1064",
            "1182",
            "1508"
          ]
        }
      ]
    },
    {
      "id": "III",
      "title": "ROAD NAMING",
      "sections": [
        {
          "id": "30-30",
          "title": "Names of roads",
          "text": "(a) Any county road may be officially named or the official name may be changed upon petition to the board of supervisors by sixty percent of the property owners owning property along the road, or upon adoption of a resolution of intention by the board of supervisors. The petition or resolution shall be set for public hearing and notice of such hearing shall be given by mailing notice to property owners owning property along the road determined by the current records of the county assessor, at least ten days before the hearing. At the hearing, or continued hearing, the board shall consider all name proposals and upon adoption or change thereof shall make an order in its minutes officially designating the name for the road. Thereafter, such road shall be known by the name so designated. (b) Any county road which has not been officially named by the board of supervisors upon motion of the board and without any resolution, hearing or notice shall be named by an order duly made and entered in the minutes of the board. Thereafter, the road shall be known by the name thus designated. (c)(1) Private road names shall be assigned to every access road that serves four or more dwellings and/or business establishments or combination thereof, except in shopping centers, apartment-type developments and other multiuse developments as may be determined by the director of environmental management. (2) Names for private roads may be initially proposed, and proposals for changes in names of existing private roads may be made by any property owner whose property is served by the road. The director of transportation or environmental management shall solicit initial proposals from one or more such property owners, who shall have thirty days to make a proposal or proposals. (3) If no proposal is received, the director of environmental management shall select a name. (4) If one or more proposals are submitted, the director of transportation or environmental management shall select one name from those submitted. (5) The name selected by the director of transportation or environmental management shall be submitted to all property owners served by the road. If a majority of such owners file written objections within fourteen days, the proposed name shall be rejected and the selection process repeated. If less than a majority of such owners file written objections, the director may either select a new name of the director’s choosing, repeat the selection process, or retain the proposed name. (6) The name selected by the director of transportation or environmental management shall be submitted to interested emergency services agencies for approval. If objections are received, the director may reject the proposed name and repeat the selection process. (7) The director of transportation or environmental management shall give written notice of the director’s final selection to all property owners served by the road who filed written objections. Any such person may appeal the selection by the director to the board of supervisors within ten days of such notice. If no appeal is filed, the selection of the director shall be final and conclusive. The board of supervisors shall hear the appeal at a public hearing preceded by ten days’ mailed notice to the owners of all property served by the road and by public posting in the area affected. The order of the board of supervisors after hearing shall be final and conclusive. (8) The board of supervisors may name any private road that is a continuation of an existing county road. The private road may have the same name as the county road it extends, subject to the exceptions provision of subparagraph (g), below. This is to insure continuity in such road names. (d) Road name selections shall be made on the basis of appropriateness and shall not exceed a length of seventeen letters. Names which are historically or descriptively significant to Solano County are encouraged. A classification of thoroughfares shall be based on intensity of use, importance, service requirements, or particular aesthetic characteristics. State thoroughfares shall be classified: state highway or road. Other public thoroughfares shall be classified: street or road. Private thoroughfares shall be classified: avenue, lane, drive, place, terrace, court, circle or trail. (e) A road shall be known by the same name for its entire length, and where roads change direction by an angle greater than ninety degrees, each directional segment shall be known by a different name. (f) An alphabetical list of all city street and county road names in Solano County shall be established and known as the Solano County master road index. The list shall be compiled and maintained by the director of environmental management. To provide future road names which are easily understood in verbal and written communications, new road names shall not be approved which have a similar spelling or sound to names in the Solano County master road index. (g) Road naming exceptions may be granted where general naming integrity is otherwise preserved and name confusion is not likely to result.",
          "ordinances": [
            "1064",
            "1182",
            "1332",
            "1508"
          ]
        }
      ]
    },
    {
      "id": "IV",
      "title": "ROAD SIGNS",
      "sections": [
        {
          "id": "30-40",
          "title": "Road signs",
          "text": "(a) Private road signs shall be identical in design to that of county road signs except the background color shall be brown for private road signs. (b) The fee for private road signs, including the installation thereof, shall be determined by the board by resolution. All signs shall be installed by the county department of transportation. (c) Signs shall be required as a condition of approval for all private roads created through the minor subdivision process. A fee as established by the board of supervisors, by resolution, shall be imposed for each sign required.",
          "ordinances": [
            "1064"
          ]
        }
      ]
    },
    {
      "id": "V",
      "title": "PENALTIES",
      "sections": [
        {
          "id": "30-50",
          "title": "Penalties",
          "text": "Any person, firm or corporation, whether as principal, agent, employee, or otherwise failing to comply with the provisions of this chapter, shall be guilty of an infraction, and upon conviction thereof, shall be punishable by a fine of not more than three hundred dollars.",
          "ordinances": [
            "1064",
            "1421"
          ]
        }
      ]
    }
  ]
}