{
  "chapter": "19",
  "title": "PARKS RECREATION AND OTHER PUBLIC PROPERTY",
  "articles": [
    {
      "id": "I",
      "title": "PARKS, PLAYGROUNDS AND RECREATION FUND",
      "sections": [
        {
          "id": "19-10",
          "title": "Created",
          "text": "Pursuant to the provisions of Section 25252, there is created a parks and recreation fund, which shall be set forth in each annual budget, shall be in addition to any other fund allowed by law, and shall be known as the “parks and recreation fund.”",
          "ordinances": [
            "810",
            "1411",
            "1675"
          ]
        },
        {
          "id": "19-20",
          "title": "Levy and collection of taxes for maintenance of fund",
          "text": "Each year, the board of supervisors shall, in the same manner that it provides for the levy and collection of taxes for other purposes, provide for the levy and collection of such taxes as may be necessary to accumulate or maintain the parks and recreation fund in such an amount as may be set forth and provided in each annual budget of the county.",
          "ordinances": [
            "810",
            "1411",
            "1675"
          ]
        },
        {
          "id": "19-30",
          "title": "Expenditures permitted",
          "text": "The parks and recreation fund may be expended for all purposes necessary for the establishment of parks, playgrounds and recreation, including, but is not limited to, the acquisition of real and personal property, construction, reconstruction and remodeling of buildings.",
          "ordinances": [
            "810",
            "1411",
            "1675"
          ]
        }
      ]
    },
    {
      "id": "II",
      "title": "IN GENERAL",
      "sections": [
        {
          "id": "19-40",
          "title": "Definitions",
          "text": "For the purposes of this chapter, the words and phrases set forth below shall have the following meanings: (a) Boat means an undocumented vessel or device other than an aquaplane or waterski, in or upon which persons or property may be transported upon, under or over the surface of water including, but not limited to, any board, raft, barge, canoe, kayak, paddleboard, skiff, dingy, rowboat, sailboard, sailing vessel, yacht, motorboat, motor vessel, float, pontoon, commercial boat, launch and ship. (b) County means the county of Solano. (c) County park means either an area owned by the county and designated by it for public park purposes or an area owned by another public entity or a land trust and used or operated by the county for public purposes. (d) Horse means equine animal such as a horse, mule, burro, pony, jack, hinny or jenny. (e) Parks division means the county parks division of the department of resource management. (f) Power boat means any boat powered by electricity or any internal combustion type motor or engine. (g) Vehicle means a device by which any person or property may be propelled, moved or drawn over land, excepting a device moved by human power.",
          "ordinances": [
            "810",
            "1335",
            "1344",
            "1411",
            "1675",
            "1742",
            "1847"
          ]
        },
        {
          "id": "19-50",
          "title": "Penalty for violation of chapter",
          "text": "(a) Unless expressly indicated otherwise, any person who violates any provision of this chapter, except provisions providing direction to the parks division, shall be guilty of a misdemeanor, and, upon conviction, shall be subject to imprisonment in the county jail for not more than six (6) months, a fine of not more than one thousand dollars ($1,000.00), or both. (b) Notwithstanding subdivision (a) of this section, any person who violates any provision of this chapter relating to the operation or parking of any motor vehicle shall be guilty of an infraction.",
          "ordinances": [
            "1489",
            "1519",
            "1675"
          ]
        },
        {
          "id": "19-60",
          "title": "Enforcement",
          "text": "(a) The Solano County sheriff, or his/her designee, shall enforce the provisions of this chapter or any other law or regulation within a county park. (b) The manager of the parks division, park ranger supervisors, park rangers, and any other person designated by the manager of the parks division are authorized to: (1) Enforce these regulations and eject any person acting in violation of these regulations from lands or facilities managed by parks division or otherwise revoke their permission to use such lands or facilities. (2) Issue citations for violations of applicable provisions of this chapter. (c) The manager of the parks division, park ranger supervisors, park rangers, and any other person designated by the manager of the parks division are not “peace officers” within the meaning of the California Penal Code and are not “park rangers” within the meaning of California Penal Code Section 830.31(b).",
          "ordinances": [
            "1742",
            "1847"
          ]
        },
        {
          "id": "19-70",
          "title": "Authority of parks division--Closing or restricting use of parks and facilities",
          "text": "(a) The parks division is authorized to close to public use a portion or all of any county park, or any lake or stream within a county park; to restrict the times when a portion or all of any county park or any lake or stream within a county park shall be open to such use; and to limit or prohibit boating, fishing, or other recreational uses in a portion or all of any county park or on any lake or stream within a county park, whenever, in its sole discretion, it deems it prudent to do so to safeguard the health, safety, and welfare of the park, any of its facilities, park division employees, or the public. (b) Situations in which the parks division may take one (1) of these steps shall include, but not be limited to, the following: unreasonable fire hazard, dangerous weather or water conditions, sanitary protection of a watershed, construction or repairs in a park, conservation of fish or game, excessive boat traffic, unsafe or unsuitable shoreline, ramp, parking or road conditions, the prevention of damage to the park or any of its facilities, or any dangerous, unsafe, or unhealthy condition. (c) Whenever the parks division closes a portion or all of any county park or any lake or stream pursuant to this section, the parks division shall report such closure to the parks and recreation commissioners on or before the next regular meeting of the commission.",
          "ordinances": [
            "1742"
          ]
        },
        {
          "id": "19-80",
          "title": "Same--Power to direct public",
          "text": "Employees of the parks division are authorized to direct the visiting public in county parks in the use of all park facilities according to law. Notwithstanding any other provision of this chapter, in the event of a fire or other emergency, employees of the parks division are authorized to direct the public as conditions may require to expedite traffic, ensure safety, or to prevent pollution of any lake or stream.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-90",
          "title": "Fees for permits, certificates and decals; refunds; annual permits; exemptions",
          "text": "(a) The fees charged by the parks division for all permits, certificates, or decals authorizing use of a county park or any of its areas or facilities shall be set forth in the department of resource management’s fee schedule. (b) No person shall enter or use any county park or any of its facilities without first paying the prescribed fee, if any, to the parks division at an established point of entry or collection, and receiving an appropriate permit, certificate, or decal. (c) No person shall, upon leaving a park, refuse to exhibit to the parks division, upon its demand, any permit, certificate, or decal which has been issued pursuant to this section. (d) No fee shall be refunded unless authorized in writing by the parks manager or designee. A denial by the parks manager or designee may be appealed to the director of resource management or designee by filing a written appeal with the parks division within ten (10) days of issuance of the denial. The director of resource management or designee shall hold a hearing to consider the appeal within sixty (60) days of the filing of the appeal. A denial by the director of resource management or designee may be appealed to board of supervisors by filing a written appeal with the clerk of the board within thirty (30) days of the issuance of the denial. (e) Annual permits shall be valid for one (1) year from the date in which they are issued, unless sooner revoked for cause or the parks division expressly issues the permit for a different period. (f) The following persons are exempt from the permit and fee requirements of this section: officers, employees, agents, and contractors and their employees of any governmental entity while engaged in the performance of their duties; concessionaires of the county and their agents, employees, suppliers, and contractors, while performing the business of the concessionaire; employees of the public utilities while performing their duties; volunteers, docents, and park hosts while engaged in the performance of the park activities; and such other persons as may be designated by resolution of the board of supervisors.",
          "ordinances": [
            "1742",
            "1847"
          ]
        },
        {
          "id": "19-100",
          "title": "Same--Revocation; person expelled from parks",
          "text": "(a) The parks division is authorized to revoke any permit, certificate or decal which it has issued, when: (1) It was issued unlawfully or erroneously; or (2) It has reasonable grounds to believe that the person to whom the permit, certificate, or decal was issued has violated one (1) or more provisions of this chapter or of state law. (b) The parks division may expel from a county park any person the parks division reasonably believes has violated one (1) or more provisions of this chapter or of state law while in a county park. No person who has been ordered expelled from a county park shall remain therein. (c) The parks division may permanently expel from the county parks any person who commits a felony within a county park or who has, on three (3) or more separate occasions, been convicted of violating or received a citation for violating one (1) or more provisions of this chapter or of state law while in a county park. (d) The parks division may, at its discretion, refuse to admit to a county park any person who has been expelled from a county park within the past two (2) years. (e) The parks division may take possession of any permit, certificate, or decal which it has revoked or which is fictitious, and no person shall fail to refuse to surrender the same to the parks division upon its demand. (f) Any person who has had a permit, certificate, or decal revoked or who has been expelled from a county park may appeal that revocation or expulsion by filing a notice of appeal with the parks manager within ten (10) days of that revocation or expulsion; provided, however, that permanent expulsions may be appealed at any time. A denial by the parks manager or designee may be appealed to the director of resource management or designee by filing a written appeal with the parks division within ten (10) days of issuance of the denial. The director of resource management or designee shall hold a hearing to consider the appeal within sixty (60) days of the filing of the appeal. A denial by the director of resource management or designee may be appealed to board of supervisors by filing a written appeal with the clerk of the board within thirty (30) days of the issuance of the denial.",
          "ordinances": [
            "1675",
            "1742"
          ]
        },
        {
          "id": "19-110",
          "title": "Boating regulations",
          "text": "(a) The parks division is authorized to establish and designate restricted boating areas and speed zones on any body of water in a county park as are reasonably necessary for the safety of persons and property. (b) The parks division is authorized to designate parts of a body of water in a county park for the exclusive use of specific classes of boats and during such specific times if, in its discretion, the parks division determines it will best serve the interests of the boating public. (c) No person shall, within a county park: (1) Operate a boat without a valid and unrevoked permit to do so from the parks division. (2) Operate a boat within a prohibited area when such area has been designated by official parks division waterways markers. (3) Operate a boat in violation of sailing patterns and buoy markings posted or placed by parks division. (4) Operate a boat at a speed greater than five (5) miles per hour within two hundred (200) feet of any boat landing dock, ramp, log boom or regular beaching area, or within one hundred (100) feet of any boat that is not under way. (5) Operate or occupy any boat while afloat during hours of darkness, without prior written approval of the parks division. (6) Keep any boat on shore overnight, except in any area designated by the parks division. (7) Leave a boat which is in a person’s care, custody and control unattended at a dock for a period of more than fifteen (15) minutes, or at any other place while afloat for a period of more than eight (8) hours without prior written approval of the parks division. (8) Launch any boat at any place other than a launching area designated by the parks division. (9) Land or beach any boat, except at dock, ramps or other places designated by the parks division. (10) Operate any boat bilge pump except in an emergency. (11) Allow waste from boat washing to discharge into a lake or stream or onto any shore or bank, except at such times and places as may be designated by the parks division. (12) Engage in a boat race, regatta, tournament or exhibition without prior written approval of the parks division. (13) Operate a boat for hire or engage in sales promotion activities of any kind without the prior written approval of the parks division. (14) Any boat which is in the person’s custody, care or control to be operated by any person who is not competent to do so safely. (d) Any boat which has been left unattended in violation of this section may be towed to a suitable storage area by the parks division at the expense of the owner or other person responsible for such boat. The charges made by the parks division for such towing and storage shall be those established by resolution of the board of supervisors, and the county shall have a possessory special lien on such boat until such charges are paid. Such lien may be foreclosed in the manner provided by the California Civil Code.",
          "ordinances": [
            "1675",
            "1847"
          ]
        },
        {
          "id": "19-120",
          "title": "Swimming",
          "text": "Swimming shall be allowed only in those areas designated by the parks division.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-130",
          "title": "Motor vehicles; removal of illegally parked vehicles",
          "text": "(a) No person shall, within a county park. (1) Drive a vehicle at a speed greater than the posted speed limit. (2) Drive a vehicle on other than established vehicular roads, trails, or parking areas. (3) Drive a vehicle unless the driver then holds a valid driver’s license issued to the driver by this or any other state or foreign jurisdiction of which the driver is a resident. (4) Drive a vehicle which has not been licensed by the motor vehicle licensing authority of this or any other state. (5) Park or leave unattended any vehicle or trailer in an area not designated by the parks division for parking. (6) Drive any vehicle in a manner demonstrating a willful or wanton disregard for the safety of persons or property. (7) Drive a two (2) or three (3) wheel vehicle which is not equipped with a factory-approved spark arrester muffler or drive any vehicle without a spark arrester in high fire hazard areas or conditions. (8) Drive any vehicle in a manner which makes an excessive or unusual noise. (9) Operate Class 2 or Class 3 electric bikes (e-bikes): only Class 1 electric bikes (no throttle, pedal assisted) are allowed in Solano County parks wherever conventional bikes are allowed unless otherwise posted. E-bike riders must adhere to the same trail rules as conventional bicycle riders. (b) The parks division is authorized to move or remove any vehicle or trailer which has been illegally parked in violation of this section.",
          "ordinances": [
            "1675",
            "1847"
          ]
        },
        {
          "id": "19-140",
          "title": "Pets",
          "text": "(a) Pets shall be permitted only in those portions of the park designated as overnight camping areas or other areas specifically designated with signs posted by the parks division. All pets, except guide dogs or dogs assisting and accompanying disabled persons, are prohibited in day use areas. The parks division shall require park visitors with dogs to present a valid license or proof that the dog has had a valid rabies inoculation. (b) The parks division may refuse to admit to any county park, any person who possesses: (1) A pet that appears dangerous. (2) More than two (2) pets per vehicle. (3) A pet which, in the judgment of the parks division, is likely to howl or otherwise disturb unreasonably other persons in such park. (c) No person shall, within a county park: (1) Allow any pet in the person’s custody to run unrestrained or on a secure leash over seven (7') feet long. (2) Allow any pet in the person’s custody to molest or annoy any person, pet, livestock, or wildlife. (3) Allow any pet in the person’s custody to be and remain tied up and left unattended outside of a tent, vehicle, or trailer in a camp area during daylight hours. (4) Allow any pet in the person’s custody to be and remain tied up at night outside of a tent, vehicle, or trailer in a camp area. (5) Abandon within the park any animal in the person’s custody.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-150",
          "title": "Firearms and other weapons",
          "text": "No person shall use or discharge across, in, or into any portion of any park any weapon, firearm, spear, bow and arrow, trap, net, or device capable of injuring or killing any person, or animal, or capturing any animal, or damaging any public or private property, except: (a) A peace officer on duty. (b) A person other than a peace officer who is employed by or in the service of a governmental agency which authorizes the person to carry or use such weapons or devices in the performance of the person’s duty and who is on official duty.",
          "ordinances": [
            "1675",
            "1742",
            "1847"
          ]
        },
        {
          "id": "19-160",
          "title": "Prohibited acts",
          "text": "No person shall, within a county park: (a) Throw, dump, or deposit upon the surface of the ground, except in containers placed by the parks division, any trash, refuse, garbage, litter, or waste material. (b) Throw, dump, or deposit into the waters of any lake or stream, or upon the shore or banks thereof, any trash, refuse, garbage, litter, waste material, or petroleum product, or any noisome, nauseous, or offensive matter of any kind. (c) Throw or deposit any burning substance into or onto any combustible place or area, except into an authorized fire pit or incinerator. (d) Bring into such park any vehicle, trash, refuse, garbage, litter, or waste material for the purpose of leaving it therein. (e) Build, kindle, or use any cooking or similar fire, except in a camping or picnicking area in a fire pit, stove, incinerator or other similar facility provided by, or approved by, the parks division. (f) Leave unattended any fire kindled by the person. (g) Smoke tobacco or any other substance in any area that the parks division has designated as a non-smoking area pursuant to regulations adopted in accordance with Section 19-190. Any person who violates this subdivision shall be guilty of an infraction. (h) Hunt, kill, injure, or molest any animal or bird, or allow any child or animal in the person’s care or custody to do so. (i) Possess or use any fireworks or other explosives. (j) Operate any sound amplifying equipment, musical instrument, generator, or other device or machine causing excessive noise, except in accordance with the terms and conditions of a written permit issued by the parks division. For purposes of this subdivision, excessive noise shall mean any noise that a park ranger finds, in his or her sole discretion, has disturbed, may disturb, or will disturb members of the public or wildlife. (k) Land any aircraft on any water or land therein, except in an emergency. (l) Sell or advertise any product or service, or carry on any other commercial activity, or distribute any handbill, tract, or other literature, without authorization by the parks manager or designee. A denial by the parks manager or designee may be appealed to the director of resource management or designee by filing a written appeal with the parks division within ten (10) days of issuance of the denial. A denial by the director of resource management or designee may be appealed to the board of supervisors by filing a written appeal with the clerk of the board within thirty (30) days of the issuance of the denial. (m) Conduct any public demonstration without a permit issued by the parks manager or designee. A denial of the parks manager may be appealed to the director of resource management or designee by filing a written appeal with the parks division within ten (10) days of issuance of the denial. A denial by the director of resource management or designee may be appealed to the board of supervisors by filing a written appeal with the clerk of the board within thirty (30) days of the issuance of the denial. (n) Perform or participate in any group function, or any fund-raising activity, without a permit issued by the parks manager or designee. A denial by the parks manager may be appealed to the director of resource management or designee by filing a written appeal with the parks division within ten (10) days of issuance of the denial. A denial by the director of resource management or designee may be appealed to the board of supervisors by filing a written appeal with the clerk of the board within thirty (30) days of the issuance of the denial. (o) Bring in or ride a horse, except in areas and on trails designated for this purpose, without first obtaining the written permission of the parks division. (p) Allow any horse which a person was permitted to bring into the park by the parks division to be in any camping or picnicking area or in any part of such park outside of established equestrian trails or designated equestrian areas. (q) Cut, pick, mutilate, remove or destroy any vegetation or natural material, or remove soil or rock or natural material or post or paint signs on any vegetation, rock, or natural material, except as authorized by the parks division. (r) Clean fish, except at such places as may be designated by the parks division. (s) Use any fish bait that does not conform to the State Department of Fish and Game rules and regulations. (t) Enter any area where the parks division has erected signs forbidding such entry. (u) Enter any fenced utility area, or remove, destroy or tamper with any valve, switch or control of any telephone, electrical, water, or sewer line or system owned or operated by any public entity or public utility. (v) Commit any act of vandalism, including, but not limited to, removing fixtures or equipment or destroying, painting, marking, or defacing any building, sign, fixture, or other equipment. (w) Engage in any riotous, threatening, or obscene language or conduct. Any person who violates this subdivision shall be guilty of an infraction. (x) Behave in a drunk and disorderly manner or consume or possess alcoholic beverages or containers in any area that the parks division has designated as an alcohol-free area pursuant to regulations adopted in accordance with Section 19-190. Any person who violates this subdivision shall be guilty of an infraction. (y) Willfully fail or refuse to comply with any lawful order, signal, or direction of any authorized parks division employee, or refuse to submit to any lawful inspection under this chapter. (z) Possess or consume from any glass or glass bottle, except within designated camping areas. (aa) Operate self-propelled (motor driven) unmanned aircraft system (UAS, a.k.a. “drone”) model aircraft, boats, automobiles, or other model craft of any kind or description without a permit issued by the parks manager or designee.",
          "ordinances": [
            "1675",
            "1742",
            "1847"
          ]
        },
        {
          "id": "19-170",
          "title": "Boating regulations for Lake Solano and Putah Creek",
          "text": "(a) The operation of power boats on Lake Solano shall be prohibited, except those belonging to the parks division or other governmental agencies for use in rescue maintenance operations. (b) It shall be unlawful for any person to operate any boat on the waters of Putah Creek westerly of County Road No. 293 at such time that: (1) The flow of the water from Monticello Dam exceeds the rate of seven hundred fifty (750) cubic feet per second; and (2) Control signs or devices prohibiting boating are posted at the Putah Creek fishing access area. (c) The parks manager, or designee, may assist Yolo County staff in the posting of control signs or devices prohibiting boating at the Putah Creek fishing access area at such times as the flow of water at Monticello Dam exceeds the rate of seven hundred fifty (750) cubic feet per second.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-180",
          "title": "Naming of parks and park facilities",
          "text": "The parks and recreation commission shall make recommendations to the board of supervisors with regard to the naming or renaming of any park, portion of a park, or park facilities, in accordance with the adopted policy of the board of supervisors. No naming or renaming shall be effective until adopted by the board of supervisors.",
          "ordinances": [
            "1742"
          ]
        },
        {
          "id": "19-190",
          "title": "Alcohol and tobacco regulations",
          "text": "(a) The board of supervisors makes the following findings: (1) The consumption of alcohol within county parks poses significant risks to public health, safety, and welfare, including but not limited to increases in vehicular accidents, boating accidents, drownings, physical confrontations and/or altercations with other members of the public or parks division staff, litter, and excessive noise. (2) The use of tobacco within county parks poses significant risks to public health, safety, and welfare, including but not limited to substantially increased fire danger, adverse health effects on members of the public and parks division staff, increased litter, and threats to wildlife, water quality, and the environment. The findings made and purposes stated in Section 13.3-10 remain valid and are equally applicable to the impact of smoking in county parks. (b) With the approval of the board of supervisors, the parks division shall have the authority to promulgate regulations restricting the use of alcohol and/or tobacco within county parks pursuant to the following guidelines: (1) Alcohol Regulations. In promulgating regulations restricting the use and/or possession of alcohol within county parks, the parks division shall consider: (i) the risk of vehicular accidents accompanying the use of alcohol within county parks generally and within and adjacent to parking lots specifically; (ii) the risk of boating accidents accompanying the use of alcohol on boats and on or adjacent to docks; (iii) the risk of drowning accompanying the use of alcohol near swimming pools, beaches, and docks; (iv) the risk of physical confrontations and/or altercations with members of the public and parks division staff; (v) the impact of alcohol-related litter; (vi) the impact of excessive noise that often accompanies the consumption of alcohol; (vii) the effectiveness and ease of enforcement by park rangers; (viii) the need to post appropriate signs indicating the areas within the parks that alcohol is permitted and prohibited; and (ix) the ability of members of the public to understand the regulations. (2) Tobacco Regulations. In promulgating regulations restricting the use of tobacco within county parks, the parks division shall consider: (i) the risk of fire danger accompanying smoking in different areas of county parks; (ii) the effect of second-hand smoke on members of the public and parks division employees, including but not limited to a consideration of the use of tobacco in common areas (e.g., restrooms, shower buildings, picnic tables, fishing ponds, trails, docks, bridges, dumping stations, shore and beach areas, group fire areas, group campsites, concession areas, playgrounds, and park borders with private property), the effect of prevailing wind patterns within county parks, the California Air Resources Board’s classification of second-hand smoke as a toxic air contaminant, and compliance with the Americans with Disabilities Act and other state and federal laws; (iii) that in California non-smokers outnumber smokers by more than five (5) to one (1); (iv) the impact of smoking on wildlife, plant life, and the environment; (v) the impact of smoking on water quality; (vi) the impact of increased tobacco and smoking-related litter; (vii) the need to ensure access to campsites of equal quality for non-smokers and smokers; (viii) the effectiveness and ease of enforcement by park rangers; (ix) the need to post appropriate signs indicating smoking and non-smoking areas of the parks; and (x) the ability of members of the public to understand the regulations.",
          "ordinances": [
            "1675"
          ]
        }
      ]
    },
    {
      "id": "III",
      "title": "CAMPING OR SQUATTING",
      "sections": [
        {
          "id": "19-200",
          "title": "Authority and purpose",
          "text": "It shall be the policy of the County of Solano to protect public and private property within the unincorporated area of the County from the destruction and littering that may accompany camping or squatting. Public roads and areas within the county should be readily accessible and available to residents and the public at large. This article is enacted to prevent degradation of public and private lands and to ensure that such lands are utilized for their intended purpose. It is also enacted to ensure that proper health and safety accommodations are provided to those who lawfully camp.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-210",
          "title": "Definitions",
          "text": "For purposes of this article, the words and phrases set forth below shall have the following meanings: (a) Camping means to establish or maintain on public or private property a temporary or permanent place for cooking, sleeping, or storing personal belongings either: outdoors, with or without shelter; in, on, or under any structure not intended for human occupancy; in, on, or under any parked vehicle; or in, on, or under any abandoned or unoccupied structure. For purposes of this definition, establishing or maintaining a place for sleeping shall include setting up bedding, including, but not limited to, sleeping bags, blankets, mattresses, tents, hammocks, and cots for the purpose of sleeping. For purposes of this definition, personal belongings includes, but is not limited to, clothing, sleeping bags, bed rolls, blankets, sheets, luggage, backpacks, kitchen utensils, cookware, and similar material. (b) Squatting means unlawfully settling on another’s land without legal title or authority to do so, or entering upon another’s land in bad faith claiming the right to do so by virtue of any title of one’s own or by virtue of some agreement with another whom one believes to hold title. (c) Camp facilities include, but are not limited to, a vehicle which is a motor home, travel trailer, truck camper, or camping trailer with or without motive power, designed for human habitation, for recreation, travel accommodations purposes or emergency occupancy, tents, huts, and temporary shelters. (d) Camp paraphernalia includes but is not limited to tarpaulins, cots, beds, sleeping bags, hammocks, or similar equipment.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-220",
          "title": "Camping regulations",
          "text": "(a) No person shall camp within a county park without a valid, unexpired, unrevoked permit. The parks division may at any time revoke the camping permit of any person if the campsite occupied by such person is not maintained by that person in a reasonably clean, sanitary, and attractive manner. (b) No person shall camp within a county park except within designated camping areas. (c) The holder of a camping permit shall affix it to the person’s campsite marker. No person shall move, mutilate, or destroy any campsite marker or permit without the prior consent of the parks division. (d) Camping permits shall be issued so as to expire after a maximum of fourteen (14) days. All camping permits expire at the posted time on the expiration day. No person shall camp for more than fourteen (14) days in any thirty (30) day period, and, once a person has camped for fourteen (14) days within any thirty (30) day period, that person shall not be permitted to camp for a period of thirty (30) additional days. (e) No person shall, without the prior written approval of the parks division, park more than two (2) motor vehicles at any one (1) campsite. (f) Quiet shall be observed in all camping areas of a county park between the hours of 10:00 p. m. and 7:00 a. m. During these hours, no person shall make, either verbally or mechanically, any excessive noise. For purposes of this subdivision, excessive noise shall mean any noise that a park ranger finds, in his or her sole discretion, has disturbed, may disturb, or will disturb members of the public or wildlife. (g) No person under the age of eighteen (18) shall camp within a county park unless accompanied by a parent, legal guardian, adult leader (e.g., teacher, coach, or scoutmaster) of a school or other youth group, or the parent or legal guardian of another minor camping in the same group.",
          "ordinances": [
            "1675",
            "1847"
          ]
        },
        {
          "id": "19-230",
          "title": "Camping or squatting prohibited on public property",
          "text": "(a) No person shall camp or squat in any unincorporated County area not designated by the parks division as a campground. (b) Except as may be permitted within county parks by the parks services manager, it shall be unlawful to camp or squat upon any public property owned or maintained by the county, including, without limitation, streets, roads, easements, parks, dump sites, river banks or shores, creek beds, electric utility substations, parking lots, or corporation yards. No person shall, on any public property owned or maintained by the county, set up, establish, or maintain a tent, shack, house trailer, motor home, camp trailer, camper, or any other temporary or permanent shelter for the purpose of camping or squatting, nor shall any person leave in any such place any movable structure or special vehicle to be used or that could be used for such a purpose, such as a house trailer, tent, automobile, or similar vehicles. Violation of this section is a misdemeanor.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-240",
          "title": "Camping or squatting prohibited on private property",
          "text": "(a) Except as otherwise provided in this section, it is unlawful to camp or squat upon private property within the unincorporated area of the County. No person shall set up, establish, or maintain a tent, shack, motor home, camp trailer, camper, or any other temporary or permanent shelter for the purpose of camping or squatting, nor shall any person leave upon any private property any movable structure of special vehicle to be used or that could be used for such purpose, such as a tent or automobile, or similar vehicles. Violation of this section is a misdemeanor. (b) This section shall not apply to persons camping upon their own land or camping with the owner of the land, or to persons camping with the written consent of the owner of the land, provided that such written consent is in their possession at the time and is shown upon demand of any law enforcement officer, and provided that all local zoning ordinances of the County are met and all Health and Safety Code sections of the State are complied with. (c) This section shall not apply to persons lawfully camping within campgrounds, mobile home parks, recreational vehicle parks, or trailer parks specifically designated and approved for such use pursuant to the Solano County Code.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-250",
          "title": "Campfires",
          "text": "(a) No person shall kindle or maintain an open campfire or bonfire, except on park property as designated by the parks services manager. (b) Nothing in this chapter shall be construed to permit fires otherwise prohibited by law or to negate the requirement for burning permits otherwise required by law.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-260",
          "title": "Enforcement",
          "text": "The law enforcement officer enforcing this article shall issue a citation to any person camping or squatting on public or private property.",
          "ordinances": [
            "1675"
          ]
        },
        {
          "id": "19-270",
          "title": "Severability",
          "text": "If a court of competent jurisdiction deems any portion of this article invalid or unenforceable, that portion shall be severed from the remainder which shall remain in full force and effect.”",
          "ordinances": [
            "1675"
          ]
        }
      ]
    },
    {
      "id": "IV",
      "title": "USE OF PUBLIC PROPERTY",
      "sections": [
        {
          "id": "19-300",
          "title": "Purpose of regulations; applicability of article",
          "text": "The Board of supervisors declares that these regulations, relating to the use of county-owned property by the general public and particularly by organized groups and organizations described in this section, are necessary for the preservation of life, limb and property, and the orderly use of these public facilities, and to preserve them for the benefit of the general public.",
          "ordinances": []
        },
        {
          "id": "19-310",
          "title": "Permit for use - Required; conditions imposed",
          "text": "No person and no organized group or organization shall make use of any of the property described in section 19-300 for meetings, conferences, rallies or other similar gatherings or purposes, designed or likely to attract large numbers of people, without first having obtained a permit from the county, as provided in this article. Such permit must be obtained at least two weeks prior to the anticipated date of the event in question. Permits may be issued to authorize the holding of regularly scheduled meetings. Permits authorizing regularly scheduled meetings shall be valid until revoked. The county may impose reasonable conditions upon all such permits, including but not limited to the following: (a) Collection of applicable fees. (b) A deposit of cash or a bond from a recognized surety company to insure clean-up and restoration of the premises used, after use. The amount of such deposit or bond shall be determined with reference to the type of event and the number of persons anticipated. (c) Insurance protecting the county against liability for injury or death of persons and against liability for property damage in amounts determined appropriate by the County Risk Manager. (d) A cash bond or surety bond from a recognized surety company to compensate the county for any damage to county property, the amount of such deposit or bond to be determined with reference to the type of event and the number of persons anticipated. (e) A program for the policing of the event, at applicant’s cost, including, in the case of political rallies, protection of the lives and limbs of prominent persons, and including also, where appropriate, vehicular and pedestrian traffic controls. Such program shall first be submitted to the sheriff of the county and to the chief of police of the city concerned, when the event is to take place in an incorporated city, for approval at least ten days prior to the first day of such event. This condition shall in no event be construed to require any law enforcement office concerned to undertake more than its normal duties in such cases. (f) Control and regulation of all amplifying devices and other noise or music producing machinery. (g) Furnishing, installation and removal of protective devices for county property, including trees, shrubbery and flowers. The provisions of this section shall not apply to meetings of public agencies and officials including central committees, in the performance of the duties of their office or employment.",
          "ordinances": [
            "1711"
          ]
        },
        {
          "id": "19-320",
          "title": "Same - Issuance",
          "text": "Except as otherwise provided in this article, all permits shall be issued and conditions imposed by the department of resource management, which may consult with other appropriate county and city agencies to determine reasonable conditions. All permits shall be in writing and shall contain a statement of all applicable conditions.",
          "ordinances": [
            "1711",
            "1847"
          ]
        },
        {
          "id": "19-330",
          "title": "Same - Keeping permit on premises",
          "text": "At all times during the course of the event permitted under this article, a responsible person shall be on the premises concerned, with the original permit in possession at such times. Upon request of any county official or peace officer, such permit shall be available for inspection.",
          "ordinances": [
            "1335",
            "1344",
            "1411",
            "1518",
            "1648"
          ]
        }
      ]
    }
  ]
}