{
  "chapter": "26.5",
  "title": "UNDERGROUND UTILITIES",
  "articles": [
    {
      "id": "I",
      "title": "General Provisions",
      "sections": [
        {
          "id": "26.5-10",
          "title": "Definitions",
          "text": "For the purposes of this chapter, the following words or phrases shall have the respective meanings assigned to them herein, unless the text clearly indicates otherwise: **Board of supervisors** means the board of supervisors of the county. **Commission** means the public utilities commission of the state. **Person** means individuals, firms, corporations, partnerships and their agents and employees. **Poles, overhead wires and associated overhead structures** mean poles, towers, supports, wires, conductors, guys, stubs, platforms, cross arms, braces, transformers, insulators, cutouts, switches, communication circuits, appliances, attachments and appurtenances located above ground within a district and used or useful in supplying electric, communication or similar or associated services. **Underground utility district or districts** means that area in the county within which poles, overhead wires and associated overhead structures are prohibited, as such area is described in a resolution adopted pursuant to the provisions of section 26.5-12. **Utility** means all persons or entities supplying electric, communication or similar or associated service by means of electrical materials or devices.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-11",
          "title": "Hearing to determine necessity for underground installation; notice to property owners",
          "text": "The board of supervisors may from time to time call public hearings to ascertain whether the public necessity, health, safety or welfare requires the removal of poles, overhead wires and associated overhead structures within designated areas of the county and the underground installation of wires and facilities for supplying electric, communication or similar or associated services. The clerk to the board shall notify all affected property owners as shown on the last equalized assessment roll and utilities concerned by mail of the time and place of such hearings at least ten days prior to the date thereof. Each such hearing shall be open to the public and may be continued from time to time. At each such hearing, all persons interested shall be given an opportunity to be heard. The decision of the board of supervisors shall be final and conclusive.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-12",
          "title": "Establishment of districts by resolution",
          "text": "If, after any such public hearing, the board of supervisors finds that the public necessity, health, safety or welfare requires such removal and such underground installation within a designated area, the board of supervisors shall, by resolution, declare such designated area an underground utility district and order such removal and underground installation. Such resolution shall include a description of the area comprising such district and shall fix the time within which such removal and underground installation shall be accomplished and within which affected property owners must be ready to receive underground service. A reasonable time shall be allowed for such removal and underground installation, having due regard for the availability of labor, materials and equipment necessary for such removal and for the installation of such underground facilities as may be occasioned thereby.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-13",
          "title": "Maintenance of overhead facilities prohibited after establishment of district",
          "text": "Whenever the board of supervisors creates an underground utility district and orders the removal of poles, overhead wires and associated overhead structures therein as provided in section 26.5-12, it shall be unlawful for any person or utility to erect, construct, place, keep, maintain, continue, employ or operate poles, overhead wires and associated overhead structures in the district after the date when such overhead facilities are required to be removed by such resolution, except as such overhead facilities may be required to furnish service to an owner or occupant of property prior to the performance by such owner or occupant, of the underground work necessary for such owner or occupant to continue to receive utility service as provided in section 26.5-17, and for such reasonable time required to remove such facilities after such work has been performed, and except as otherwise provided in this chapter.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-14",
          "title": "Exceptions",
          "text": "(a) Emergency or unusual circumstances. Notwithstanding the provisions of this chapter, overhead facilities may be installed and maintained for a period not to exceed ten days without authority of the transportation director in order to provide emergency service. The transportation director may grant special permission, on such terms as the transportation director may deem appropriate, in cases of unusual circumstances, without discrimination as to any person or utility, to erect, construct, install, maintain, use or operate poles, overhead wires and associated overhead structures. (b) Exempt facilities. This chapter and any resolution adopted pursuant to section 26.5-12, shall, unless otherwise provided in such resolution, not apply to the following types of facilities: (1) Any municipal facilities or equipment installed under the supervision, and to the satisfaction of, the transportation director. (2) Poles or electroliers used exclusively for street lighting. (3) Overhead wires (exclusive of supporting structures) crossing any portion of a district within which overhead wires have been prohibited, or connecting to buildings on the perimeter of a district, when such wires originate in an area from which poles, overhead wires and associated overhead structures are not prohibited. (4) Poles, overhead wires and associated overhead structures used for the transmission of electric energy at nominal voltages in excess of thirty-four thousand five hundred volts. (5) Overhead wires attached to the exterior surface of a building by means of a bracket or other fixture and extending from one location on the building to another location of the same building or to an adjacent building without crossing any public street. (6) Antennae, associated equipment and supporting structures used by a utility for furnishing communication services. (7) T.V. and radio antennae located on the premises of the user. (8) Equipment appurtenant to underground facilities, such as surface-mounted transformers, pedestal-mounted terminal boxes and meter cabinets and concealed ducts. (9) Temporary poles, overhead wires and associated structures used or to be used in conjunction with construction projects.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-15",
          "title": "Notice to property owners and utility companies upon formation of district",
          "text": "Within ten days after the effective date of a resolution adopted pursuant to section 26.5-12, the clerk to the board shall notify all affected utilities and all persons owning real property within the district created by such resolution of the adoption thereof. The clerk to the board shall further notify such affected property owners of the necessity that, if they, or any person occupying such property, desire to continue to receive electric, communication or similar or associated services, they or such occupant shall provide all necessary facility changes on their premises so as to receive such service from the lines of the supplying utility or utilities at a new location, subject to applicable rules, regulations and tariffs of the respective utility or utilities on file with the commission. Notification by the clerk to the board shall be made by mailing a copy of the resolution adopted pursuant to section 26.5-12, together with a reference to the appropriate section of this chapter, to affected property owners as such are shown on the last equalized assessment roll and to the affected utilities.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-16",
          "title": "Responsibility of utility companies",
          "text": "If underground construction is necessary to provide utility service within a district created by any resolution adopted pursuant to section 26.5-12, the supplying utility shall furnish that portion of the conduits, conductors and associated equipment required to be furnished by it under its applicable rules, regulations and tariffs on file with the commission.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-17",
          "title": "Responsibility of property owners",
          "text": "(a) Every person owning, operating, leasing, occupying or renting a building or structure within a district shall perform construction and provide that portion of the service connection on the owner’s property between the facilities referred to in section 26.5-17 and the termination facility on or within such building or structure being served, all in accordance with applicable rules, regulations and tariffs of the respective utility or utilities on file with the commission. (b) In the event any person owning, operating, leasing, occupying or renting such property does not comply with the provisions of subdivision (a) of this section within the time provided for in the resolution enacted pursuant to section 26.5-12, the transportation director shall post written notice on the property being served and thirty days thereafter shall have the authority to order the disconnection and removal of any and all overhead service wires and associated facilities supplying utility service to such property.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-18",
          "title": "Responsibility of county",
          "text": "The county shall remove at its own expense all county-owned equipment from all poles required to be removed hereunder in ample time to enable the owner or user of such poles to remove the same within the time specified in the resolution enacted pursuant to section 26.5-12.",
          "ordinances": [
            "805",
            "1429"
          ]
        },
        {
          "id": "26.5-19",
          "title": "Extensions of time limits",
          "text": "In the event that any act required by this chapter, or by a resolution adopted pursuant to section 26.5-12, cannot be performed within the time provided on account of shortage of materials, war, restraint by public authorities, strikes, labor disturbances, civil disobedience or any other circumstance beyond the control of the actor, then the time within which such act will be accomplished shall be extended for a period equivalent to the time of such limitation.",
          "ordinances": [
            "805",
            "1429"
          ]
        }
      ]
    }
  ]
}