{
  "chapter": "23",
  "title": "REFUSE AND GARBAGE",
  "articles": [
    {
      "id": "I",
      "title": "GENERAL PROVISIONS AND DEFINITIONS",
      "sections": [
        {
          "id": "23-10",
          "title": "Authority and citation",
          "text": "This chapter is enacted pursuant to the California Integrated Waste Management Act of 1989 (Division 30 of the Public Resources Code, commencing with §40000), and is intended to supplement and implement that statute and regulations enacted pursuant thereto, and may be cited as the “Solano County Solid Waste Ordinance.”",
          "ordinances": [
            "1111",
            "1449",
            "1526"
          ]
        },
        {
          "id": "23-11",
          "title": "Definitions",
          "text": "Except as herein expressly provided, the definitions contained in Part 1 Chapter 2 of Division 30 of the California Public Resources Code, §§ 40100 et. seq., and applicable sections of the California Code of Regulations, shall govern the interpretation of this chapter.",
          "ordinances": [
            "1111",
            "1449",
            "1526"
          ]
        },
        {
          "id": "23-12",
          "title": "Definitions--other",
          "text": "**Administrative fee** means the fee charged by the County to administer the Service Agreement between the Contractor and County for collection and transport of municipal solid waste, recyclables and green waste within Areas A-E. **Approved disposal area** means any site, location tract or land, area, building, structure or premises authorized by law as a place for the disposal of solid waste for which a permit has been issued by the Department of Resource Management, Environmental Health Services Division. **Bulky waste** means large items of solid waste, recyclables and green waste such as appliances, furniture, large auto parts, tree stumps, and other oversize wastes whose large size precludes placement into wheeled containers, bins, or cans provided by the Contractor or homeowner. **Collector** means any person engaged in the business of collecting or transporting solid waste, recyclables and green waste in any part of the unincorporated area of the county. **Contractor** means an agent or employee or any person, firm, corporation or association, or the agents or employees thereof, with whom the County has contracted under the terms set out in this Chapter to collect, transport, and dispose of municipal solid waste, recyclables and green waste materials in the unincorporated areas of the County identified by map in Chapter 23 as Areas A-E. **Department of Resource Management, Environmental Health Services Division** means the Solano County Department of Resource Management, Environmental Health Services Division, also referred to herein as the division. **Franchise** means an initial authorization, or renewal thereof, issued by the Board of Supervisors, whether such authorization is designated as a franchise, permit, license, resolution, contract, certificate, agreement, or otherwise, which authorizes the collection and disposal of municipal refuse and recyclable materials in Area E. **Green Waste** means any plant materials such as leaves, grass clippings, brush, tree cuttings, and other yard wastes. It also includes yard trimmings, untreated wood waste, natural fiber products and construction and demolition wood waste. Green waste does not include wood waste, mixed demolition or construction debris, food material, biosolids, mixed solid waste, wood containing lead-based paint or wood preservative, or mixed construction and demolition debris. **Mandatory Service Area** means any area within the unincorporated portion of the County where parcels are zoned under Chapter 28 of this code as Rural-Residential (R-R), Residential-Estate (R-E), One-Family Residence (R-S), Duplex-Residence (R-D), and Multiple-Residence (R-M) and are developed with residential dwelling units. Mandatory Service Areas are parcels zoned: • Rural Residential = RR 5, RR 2 1/2 with 5 and 2 1/2 acre minimum parcel sizes; • Residential Estate (RE 1, RE 1/2, RE 1/3, RE 1/4 with 1, 1/2, 1/3, and 1/4 acre minimum parcel sizes); or • One Family Residential (RS); or • Duplex Residential (RD); or • Multi-Family Residential (RM) **Recyclables** means a material which is part of the solid waste stream which is to be collected pursuant to the service agreement and which can be reused or processed into a form suitable for reuse through reprocessing or manufacturing, consistent with the requirements of the Act. Recyclable materials include aluminum cans, glass jars and bottles, steel (tin) food cans, bi-metal beverage cans; narrow necked Type #1 containers (PET-polyethylene terephthalate); narrow necked Type #2 containers (HDPE-high density polyethylene); newspaper, mixed paper (ledger, computer, junk mail, magazines, paperback books, cereal boxes, envelopes, paper shopping bags, wrapping paper) and corrugated cardboard. **Reduced Rate** is a reduction in the rate paid for service by customers who qualify based on a set criteria determined by the County and the Contractor. **Refuse** means garbage and rubbish. **Refuse collection permit** means the permit issued to collector by the Department of Environmental Management. **Rubbish** means non-putrescible solid wastes such as ashes, paper, cardboard, tin cans, yard clippings, wood, glass, bedding, crockery, plastics, rubber byproducts or litter **Senior Citizen** means a person who is at least 62 years of age. **Service Areas** means unincorporated territory of the County divided into the following described locations: A, B, C, D, and E as denoted on the map attached to the ordinance codified herein as Exhibit “A” (located at the end of this chapter) and incorporated as part of this chapter. **Service Agreement** means an initial authorization, or renewal thereof, issued by the Board of Supervisors, whether such authorization is designated as a franchise, permit, license, resolution, contract, certificate, agreement, or otherwise, which authorizes the collection and disposal of municipal solid waste, recyclables and green waste materials in Areas A-E. **Service Agreement Administrator** means the Solano County Department of General Services. **Solid Waste** means all garbage (kitchen and food waste and animal or vegetable waste that attends or results from the storage, preparation, cooking or handling of foodstuffs, rubbish (non-putrescible solid materials such as paper, cardboard, tin cans, yard clippings, wood, glass, bedding, crockery, plastics, rubber by-products or litter), construction and demolition debris and other materials and substances discarded or rejected as being spent, useless, worthless or in excess to the generator thereof at the time of such discard or rejection and which are normally disposed of by or collected from residential, and commercial, governmental and institutional establishments which are acceptable at Class III landfill under applicable law. **Solid Waste, Recyclables and Green Waste collection permit** means the permit issued to collector by the Department of Resource Management.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        }
      ]
    },
    {
      "id": "II",
      "title": "SOLID WASTE RECYCLABLE AND GREEN WASTE STORAGE",
      "sections": [
        {
          "id": "23-20",
          "title": "Limitations of time of storage",
          "text": "Except as otherwise provided in this chapter, no person, owner, agent, or occupant of any lot or premises, whether vacant or otherwise, or upon which a building of any kind or character is located within the unincorporated area of the county, shall permit an accumulation of solid waste to remain on such lot or premises for a period exceeding seven days. Recyclable material and green waste should be removed at a frequency that does not cause a nuisance condition. The Department of Resource Management, Health Services Division, after investigation, may require more frequent removal.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-21",
          "title": "Storage containers",
          "text": "(a) Solid waste and recyclable material shall be stored in approved containers. Green waste shall be stored in either approved containers or contained in such a manner that does not create a nuisance condition. Containers shall have lids and be made of nonabsorbent materials, leakproof, vector-resistant, durable, easily cleanable and designed for safe handling. Containers, when filled, shall not exceed reasonable lifting weights for an average physically fit individual except where mechanical loading systems are used. A limit of 250 pounds per container for mechanical loading systems is imposed. Containers shall be maintained in a clean, sound condition, free from putrescible residue. Dumpster bins shall comply with the requirements of this section, except that lids are not required and the weight limit shall be determined by the contractor. (b) Containers for solid waste, recyclables, and green waste shall be placed at curbside for collection by the authorized contractor wherever there is a subscription for garbage service. Empty containers must be removed by the customer out of public view by the day following collection.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-22",
          "title": "Storage enclosures--Commercial and industrial",
          "text": "All commercial and industrial enterprises shall be required to confine all of their solid waste, recyclables and green waste in storage enclosures. Such storage enclosures shall be constructed with an impervious floor, and where appropriate, shall have drains and be provided with hot and cold water under pressure. The storage enclosures shall be maintained at all times in a sanitary condition, and shall be located, cleaned, and maintained in such a manner so as to not become odorous, vectorial, pestiferous, or in any other way offensive, or so as to constitute a public nuisance.",
          "ordinances": [
            "1111",
            "1449",
            "1654"
          ]
        },
        {
          "id": "23-23",
          "title": "Storage enclosure--Certain animals",
          "text": "Any person responsible for the feeding to swine of organic solid waste or swill which is produced at a location other than that premises on which such swine are located, shall construct and install sanitary feeding platforms which shall be maintained at all times in a sanitary manner. Any uneaten residue of organic solid waste or swill shall be disposed of in a manner not inconsistent with this chapter and any applicable state law, within twenty-four hours of the original deposit of such organic solid waste on the feeding platforms.",
          "ordinances": [
            "1043",
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        }
      ]
    },
    {
      "id": "III",
      "title": "COLLECTIONS.",
      "sections": [
        {
          "id": "23-30",
          "title": "Mandatory service and congested area collection disposal",
          "text": "All persons residing in, a congested area and all commercial or industrial establishments shall be required to obtain mandatory services of a Contractor who has obtained a solid waste, recyclables and green waste collection permit for that Service Area from the Department of Resource Management, Environmental Health Services Division.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-31",
          "title": "Solid Waste, recyclables green waste collection areas",
          "text": "The board of supervisors has determined that, in order to facilitate the collection of commercial and residential solid waste, recyclables and green waste within the county, the unincorporated territory of the county shall be divided into the following described areas: A, B, C, D, and E as denoted on the map attached to the ordinance codified herein as Exhibit “A” (located at the end of this chapter) and incorporated as part of this chapter. Service area boundaries may be changed by resolution of the board of supervisors.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-31.1",
          "title": "Service agreement--authorized",
          "text": "For the collection and disposal of solid waste, recyclable material and green waste within the unincorporated area designated Service Areas A-E, a service agreement contract must be entered into by the County in accordance with and subject to the terms and conditions of this chapter.",
          "ordinances": [
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-31.2",
          "title": "Exclusive service agreement",
          "text": "(a) At such time as there is in force an exclusive service agreement entered into by the County with any person, firm or corporation for the collection and transport of municipal solid waste, recyclable and green waste in the unincorporated area identified by map as Service Areas A-E, it is unlawful for any person other than the persons in the employ of the contractor having such contract to collect or transport any solid waste, recyclables and green waste within Service Areas A-E. (b) Nothing contained in this chapter shall be construed to prevent or prohibit any resident in Service Areas A-E from taking, hauling, transporting and disposing of any bulky waste or solid waste, recyclable and green waste material created by occupants or visitors of the household or business provided disposal is in accordance with state and local law.",
          "ordinances": [
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-31.3",
          "title": "Audit of contractor’s records",
          "text": "The contractor shall maintain complete records of all services performed in the collection operations within the unincorporated Service Areas A-E and of all monies owing and all monies collected. Such records shall be maintained at the contractor’s office and the Department of General Services shall have the right to inspect and audit said records from time-to-time at all reasonable times.",
          "ordinances": [
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-32",
          "title": "Solid waste, recyclables and green waste collection permit required",
          "text": "Except as otherwise provided in this chapter, it is unlawful for any collector, person, firm, corporation, municipality, public agency, or institution to collect or to transport, or cause to be transported for commercial purposes, any solid waste, recyclables and green waste within the unincorporated area of the county without first obtaining a permit to do so as provided for in this chapter.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-33",
          "title": "Solid waste, recyclables and green waste collection permits--authority to issue--bond required",
          "text": "In order to protect the public health and safety, the Department of Resource Management, Environmental Health Services Division shall issue permits for the collection of residential and commercial solid waste, recyclables and green waste in the unincorporated designated area in the county. A permit shall be issued only to established collectors who are capable of transporting and disposing of solid waste, recyclables, and green waste. Such permits may be limited in number by the Department of Resource Management Environmental Health Services Division and shall be subject to special conditions, which shall be specified by the Department of Resource Management, Environmental Health Services Division as being necessary for the purposes of assuring compliance with this chapter, or any other law, or to protect the public health and safety, and to provide for continuous and effective solid waste, recyclables and green waste collection services. Additional permits may be issued if a need is shown. The issuance of a permit pursuant to this chapter shall confer no property rights or vested interests on the permittee, and the permit shall be nontransferable. Prior to the issuance of any permit required herein, the applicant shall be required to post a corporate surety bond, a letter of credit, cash or any other security deemed acceptable by the Department of Resources Management, Environmental Health Services Division, in the minimum amount of fifty thousand dollars ($50,000). Said security shall be to insure faithful and continued service under the terms and conditions of the permit to be issued.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-34",
          "title": "Territory described in the permit",
          "text": "The Department of Resource Management, Environmental Health Services Division shall specify, in all permits or renewals, the territory as described in section 23-31 within which the permittee may collect within the county. A permittee shall provide solid waste, recyclables and green waste collection service to all residences and commercial or industrial establishments within the service area designated by the collector’s permit. All collected solid waste, recyclables and green waste shall be disposed of in disposal areas approved by the Department of Resource Management, Environmental Health Service Division, or the California Integrated Waste Management Board. A permittee shall not collect outside the territorial limits fixed in the permit issued to the permittee.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-35",
          "title": "Application contents",
          "text": "The application for any solid waste, recyclables and green waste collection permit shall be made in writing to the Department of Resource Management, Environmental Health Service Division. Every application for a permit shall specify as a minimum the following: (a) A statement to the effect that the applicant has arranged for the disposal of all solid waste, recyclables and green waste collected or transported by the applicant at a disposal site which is approved by the California Integrated Waste Management Board; (b) The location of the disposal site; (c) Data showing that the applicant is qualified to render efficient solid waste, recyclables and green waste collection service; (d) A statement to the effect that the applicant owns, or has under the applicant’s control, sufficient vehicles and equipment in good mechanical condition in order to adequately conduct the business of solid waste, recyclables and green waste collection; provided, the applicant is granted a permit. The number and types of trucks, or other vehicles to be used in providing the collection service, shall be specified; (e) A statement to the effect that the vehicles and equipment conform to all applicable provisions of this chapter and to the regulations of the Department of Resource Management, Environmental Health Services Division; (f) A statement that there is a need and necessity for the proposed service within the service area which is sought to be served; (g) Evidence sufficient in the judgment of the Department of Resource Management, Environmental Health Services Division that the applicant has workers compensation as required by law, and general liability and vehicular insurance in the form and amounts prescribed by the county risk manager; (h) Evidence sufficient in the judgment of the Department of Resource Management, Environmental Health Services Division that the applicant maintains an office and telephone service during normal working hours; (i) In addition to any of the requirements enumerated in subdivisions (a) through (h) above, the Department of Resource Management, Environmental Health Services Division may require any reasonable additional information or documentation which it deems necessary to process the application.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-36",
          "title": "Collection of animal waste",
          "text": "Any person who collects dead animals, bones or meat scraps for tallow plants to be used as raw material in manufacturing, to be disposed of at any location other than a disposal site operating under a permit required by this chapter, shall comply with all sanitary requirements for the collection and transportation of solid waste. The collector shall submit to the Department of Resource Management monthly reports, specifying the tonnage or yardage of solid waste, the location and method of disposal of any animal waste. The Department of Resource Management, Environmental Health Services Division may require the submission of monthly reports from such person, specifying the tonnage or yardage of solid waste, the location and method of disposal of any animal waste. A permit for this collection shall be required by the Department of Resource Management, Environmental Health Services Division.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-37",
          "title": "Solid waste, recyclables and green waste collection vehicles",
          "text": "(a) Commercial vehicles used in the business of transportation of solid waste, recyclables and green waste shall have painted on the outside of each side wall of the hauling body, in letters visible from 50 feet of distance, in a color contrasting to the body color: (1) The name of the collector, transporter or company; (2) The number of the vehicle, if more than one is operated by the collector, transporter or company (Ord. No. 405, Art. 6, Para. 7). (b) A means of covering and containing solid waste, recyclables and green waste securely within the hauling body of every vehicle shall be provided. No such materials shall be permitted to escape from the vehicle.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-38",
          "title": "Exemption from residential collection service",
          "text": "(a) Any owner of a dwelling in a mandatory service area may apply to the Department of Resource Management, Environmental Health Services Division to be exempt from the collection service on a form supplied by the Department. The application shall be accompanied by the required, non-refundable application fee. The exemption may be granted provided the owner can demonstrate one of the following: (1) The method of storage, transportation and disposal or recycling, as applicable, of all solid waste, recyclables and green waste will be conducted in a manner consistent with the intent of this code and procedures approved by the Department of Resource Management and in such a manner that will not create unsanitary conditions, potential public health threat, environmental contamination or nuisance; or (2) Every residential unit on the property is vacant for a period in excess of two months such that no solid waste or recyclables will be produced and a plan for proper removal and recycling or disposal of green waste is provided. (3) The Department of Resource Management, Environmental Health Services Division may for good cause permit additional exemptions provided that such an exemption will not create an unsanitary condition, potential public health threat, environmental contamination or nuisance. (b) Any owner issued an exemption were disposal or recycling of solid waste, recyclables or green waste is required shall provide proof to the Department of Resource Management of the property disposal or recycling of such solid waste, recyclables or green waste at an approved facility. The Department of Resource Management shall specify the intervals at which such documentation is required to be submitted. (c) An exemption may be revoked by the Department of Resource Management, Environmental Health Services Division upon a finding that there is an unsanitary condition, potential public health threat, environmental contamination or nuisance condition being created (d) Any exemption issued is non-transferable and shall remain valid upon submission of any required exemption fee, and demonstration that the terms and condition of the exemption(s) still exists at a frequency of not more than once per year or less than once every three years as established in procedures approved by the Department of Resource Management.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654",
            "1714"
          ]
        }
      ]
    },
    {
      "id": "IV",
      "title": "SOLID WASTE DISPOSAL SITES",
      "sections": [
        {
          "id": "23-39",
          "title": "Permit required",
          "text": "Except as otherwise provided by this chapter or the laws and regulations which this chapter implements, it is unlawful for any person to operate a solid waste disposal facility in Solano County unless a permit for such operation is first obtained from the Department of Resource Management, Environmental Health Services Division according to the provisions of Article 1 of Chapter 3 of Part 4 of Division 30 of the Public Resources Code, Section 44001 et seq., and applicable sections of the California Code of Regulations.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-40",
          "title": "Solid waste disposal site standards",
          "text": "The provisions of Division 30 of the Public Resources Code and the applicable sections of the Code of Regulations shall govern the operation of solid waste disposal sites.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        }
      ]
    },
    {
      "id": "V",
      "title": "FEES AND RATES",
      "sections": [
        {
          "id": "23-50",
          "title": "Inspection fees",
          "text": "A fee for periodic inspection by the Department of Resource Management shall be required from the operators of all solid waste collection or transportation enterprises and for the operation of any disposal site permitted with the county. The amount, time and method of payment of said fees shall be fixed by the board of supervisors by ordinance and may be altered or modified from time to time, by the board of supervisors.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-51",
          "title": "Administrative fee",
          "text": "An administrative fee may be charged by the County that shall be collected by the Contractor of each service area as determined by resolution by the Board of Supervisors. Contractor will be authorized to pass along this increase to the service rates set forth in Section 8 of the Service Agreement in the same amount as the increase in the Administrative Fee. Any increase in the Administrative Fee shall be separate from the annual service rate increases or decreases Contractor is entitled to receive pursuant to Section 10 of the Service Agreement. The fee shall be paid by the contractor on a quarterly basis to the Department of General Services.",
          "ordinances": [
            "1526",
            "1654"
          ]
        }
      ]
    },
    {
      "id": "VI",
      "title": "APPEALS",
      "sections": [
        {
          "id": "23-60",
          "title": "Appeals--Procedure",
          "text": "Any person who is dissatisfied with a decision or ruling of the Department of Recourse Management, Environmental Health Services Division as regards application for exemptions, permits or regulations, directives or decisions may appeal to the board of supervisors, sitting as a hearing panel pursuant to section 44300 et seq. of the Public Resources Code. An appeal shall be made by filing a notice of appeal with the Clerk of the Board of Supervisors within ten days after the date of the decision or ruling being appealed. The notice of appeal shall be signed by the appellant or the appellant’s attorney and shall set forth in detail the facts surrounding the decision of the Department of Resource Management, Environmental Health Services Division and, in substance, the specific decision or ruling being appealed. No later than thirty days after receipt of such notice of appeal, the Board of Supervisors shall set the matter for hearing. At such hearing, the appellant shall present a statement and evidence in such form as the Board of Supervisors may require.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        }
      ]
    },
    {
      "id": "VII",
      "title": "ENFORCEMENT.",
      "sections": [
        {
          "id": "23-70",
          "title": "Department of Resource Management, Environmental Health Services Division, Enforcement Agency",
          "text": "The Department of Resource Management, Environmental Health Services Division, shall be the Enforcement Agency of this chapter and all state laws and regulations related thereto unless otherwise started herein. The Department of Resource Management, Environmental Health Services Division is empowered to withhold issuance of a permit or, revoke a permit issued under this chapter if it determines that vehicles, area or other facilities for establishment, maintenance, conduct or operation of a solid waste, recyclables and green waste collection or transportation service, or the operation of a disposal site, are insufficient or unfit for use, or is established or operating in violation of this chapter, or the provision of any other ordinance of the county or state law, a regulation relating to solid waste disposal.",
          "ordinances": [
            "1111",
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-71",
          "title": "Department of General Services, franchise/Service Agreement administrator",
          "text": "The Department of General Services, as the franchise/service agreement administrator, shall have the responsibility to administer the agreement, review unresolved customer complaints, conduct annual audits of contractor’s records, and initiate lien proceedings when required. The contractor shall comply with the standards established in the franchise/service agreement for the collection and disposal of municipal solid waste, recyclables and green waste materials within the service areas designated by the map as Areas A, B, C, D and E. A verified and continuing pattern of non-compliance by the contractor may be deemed a material breach of the franchise/service agreement.",
          "ordinances": [
            "1449",
            "1526",
            "1654"
          ]
        },
        {
          "id": "23-72",
          "title": "Billing charges to be a lien",
          "text": "(a) All billing for waste collection shall be made by the contractor; all charges shall become delinquent thirty days after the billing date and subject to lien sixty days after the billing date. (b) If the bill remains unpaid after the date of delinquency, the contractor shall be entitled to a delinquency fee. Notice of the delinquency shall be given to the property owner by the contractor within fifteen days after the delinquency date. The form and content of the delinquency notice shall be approved by the Department of General Services. Delinquency fees shall be set by the Board of Supervisors’ resolution. (c) Should the bill remain unpaid for a period of sixty days from the billing date, the contractor may assign the bill to the County for lien proceedings once per year during the month of May. The contractor shall simultaneously file with the Department of General Services a formal written report listing the delinquent amounts, service addresses, Assessor Parcel Numbers, property owners, and the dates the delinquency notices were sent to the property owners. (d) Upon the County’s receipt of the assignment and report from the contractor and at the convenience of the County, the Department of General Services shall initiate proceedings complying with Government Code sections 25831 to create a lien on the real property to which the collection service has been rendered. (e) The lien will be officially recorded in the County Recorder’s office and a copy of the recorded lien shall be sent to the property owner in accordance with Government Code section 27297.5. The lien may carry additional administrative charges as set forth by Board of Supervisors resolution.",
          "ordinances": [
            "1449",
            "1526",
            "1598",
            "1654",
            "1704"
          ]
        },
        {
          "id": "23-73",
          "title": "Penalties",
          "text": "Any person, firm, corporation, whether as principal, agent, employee, or otherwise, failing to comply with the provisions of this chapter, shall be guilty of an infraction, and upon conviction thereof, shall be punishable by a fine of not more than five hundred dollars for each day of violation. Each day of violation shall be deemed to be a separate offense.",
          "ordinances": [
            "1067",
            "1111"
          ]
        }
      ]
    }
  ]
}